package com.example.heart;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.util.Log;
import android.widget.TextView;

import java.util.Random;

public class MainActivity extends AppCompatActivity {

    String[] words={
            "第一次见你的时候，我的心里已经炸成了烟花。",
            "喜欢我就和我讲，我又不是不负责任。",
            "像我这种上课睡觉的人，也只有听到你的名字才会抬头。",
            "螃蟹在剥我的壳，笔记本在写我，漫天的我落在枫叶的雪花上，而你在想我",
            "你这么甜，是蜜桃派来的吧？",
            "我想我可能是盐吃多了，总是闲的想你。",
            "你走你的路，我也走你的路。",
            "我还是喜欢一切没有规律可循的事情，比如我躺在书上看星空，你突然就掉下来砸在我怀里。",
            "我想扯下一块星光，喂你尝尝看味道像不像化开的芝士。",
            "你以为我经常跟你聊天就是喜欢你？你以为的很对，我就是喜欢你",
            "喜欢你的感觉，怎么说呢，比冬天的暖炉还暖比夏天的雪糕还甜",
            "是不是当思念汇集成了一条河，你就可以乘舟而来吖",
            "世间万物，唯你最入我心",
            "我发脾气的时候你就老老实实的听着，结束了我会认怂给你看",
            "我有很多情话，只想说给你听",
            "被你点赞过的朋友圈，叫做甜甜圈",
            "我对另一半的要求就是必须是你",
            "我们去吃全家桶吧这样我们就是一家人了",
            "地球和太阳都不是宇宙的中心，你才是",
            "我觉得我有点花心，你每天的样子我都好喜欢",
            "这乱七八糟的生活啊，因为你的闯入，变得好极了",
            "月亮被嚼碎变成了小星星，你就藏在漫天的星光里",
            "你是我的众星捧月，所有的温柔都只为你",
            "以后你有什么打算，想在你心上安个家",
            "晚安过后，你在睡觉,我在想你",
            "如果你感到辛苦，就来我怀里躲躲",
            "你现在不珍惜我，我告诉你，过了这个村，我下个村等你",
            "晚什么安，我巴不得你想我想的夜不能寐",
            "上了我的贼船，就必须和我返航",
            "你摸摸我的脸，这面料，是不是做你男朋友的料",
            "星星都睡着了，再悄悄想你一下吧",
            "生活很好，你也很好，未来可期",
            "喜欢到全世界森林里的老虎都化成黄油",
            "今天也十分喜欢你，满分是十分奥",
            "斯人若彩虹，遇上方知有",
            "你是年少的欢喜，反过来也是你",
            "我想和你喝酒是假，我想你醉在我怀里是真",
            "别再祸害别人，祸害我吧",
            "所有的门都应该你来敲，因为你敲好看",
            "醒来觉得，甚是爱你",
            "夏天总想你，夏天不听话",
            "所有温暖如春的句子里都藏着你的脸",
            "你应该被抱紧，有风我来顶",
            "苦海无涯，回头是...回头是我",
            "未经允许，擅自喜欢你了，不好意思",
            "想我了就说吧，没准我也在做同样的事",
            "陌生花开，可缓缓归矣",
            "这个世界不会迁就你，但我会",
            "爱你如初，可千万勿虑啊",
            "你需要工作嘛？我最近在招人喜欢",
            "生活小常识：洗澡的时候打开一把伞就不用擦干了",
            "你是个可爱又浪漫的麻烦",
            "当下心动便是最珍贵",
            "月亮照会湖心，野鹤奔向闲云，我步入你",
            "世界需要讲讲大力，但我最偏心你",
            "晚是世界的晚，安是给你的安",
            "你真可爱，我说时来不及思索，而思索之后，还是这样说",
            "希望我能成为你的小众喜好，藏着时欣喜不已，炫耀时格外骄傲",
            "你是四月里的清风入怀，甚是可爱",
            "夏天太浪漫了，我想请他吃顿饭，如果你有空，可以一起来",
            "不想和你错过下一个冬天了",
            "想把你，和沾了甜酱的黄昏一起吃掉",
            "在别人面前时小英雄，在你面前呢，只想做小混蛋",
            "你住在我梦里也太久了，该交房租了",
            "希望这个冬天被各种火锅 奶茶 还有你的怀抱紧紧包围着",
            "我有些自私，想让你爱我并且只爱我"
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        Random random=new Random();
        int index=random.nextInt(words.length-1)%(words.length+1);
        TextView tv=findViewById(R.id.main_word);
        tv.setText("    "+words[index]);

    }

}
